Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lb_listener.lb_listener will be created
+ resource "aws_lb_listener" "lb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:loadbalancer/app/atlantis-lb-tf/2bf03333af158c1c"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563"
          + type             = "forward"
        }
    }

  # aws_lb_listener.lb_listener-4141 will be destroyed
- resource "aws_lb_listener" "lb_listener-4141" {
      - arn               = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener/app/atlantis-lb-tf/2bf03333af158c1c/e785ad660f533e05" -> null
      - id                = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener/app/atlantis-lb-tf/2bf03333af158c1c/e785ad660f533e05" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:loadbalancer/app/atlantis-lb-tf/2bf03333af158c1c" -> null
      - port              = 4141 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> null
          - type             = "forward" -> null
        }
    }

  # aws_lb_listener.lb_listener-80 will be destroyed
- resource "aws_lb_listener" "lb_listener-80" {
      - arn               = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener/app/atlantis-lb-tf/2bf03333af158c1c/2f265d0718291fa5" -> null
      - id                = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener/app/atlantis-lb-tf/2bf03333af158c1c/2f265d0718291fa5" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:loadbalancer/app/atlantis-lb-tf/2bf03333af158c1c" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order = 1 -> null
          - type  = "redirect" -> null

          - redirect {
              - host        = "#{host}" -> null
              - path        = "/#{path}" -> null
              - port        = "4141" -> null
              - protocol    = "HTTP" -> null
              - query       = "#{query}" -> null
              - status_code = "HTTP_301" -> null
            }
        }
    }

  # aws_lb_listener_rule.listener_rule must be replaced
-/+ resource "aws_lb_listener_rule" "listener_rule" {
      ~ arn          = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener-rule/app/atlantis-lb-tf/2bf03333af158c1c/e785ad660f533e05/e463da31c7434fdd" -> (known after apply)
      ~ id           = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener-rule/app/atlantis-lb-tf/2bf03333af158c1c/e785ad660f533e05/e463da31c7434fdd" -> (known after apply)
      ~ listener_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener/app/atlantis-lb-tf/2bf03333af158c1c/e785ad660f533e05" -> (known after apply) # forces replacement
      ~ priority     = 1 -> (known after apply)
      - tags         = {} -> null
      ~ tags_all     = {} -> (known after apply)

      ~ action {
          ~ order            = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 3 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.jmvbxx.com/lock?id=jmvbxx%252Fatlantis-ansible%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 2 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
